src/Documents/ГТД/ГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГТД</name>
  <basedOn>Document.Контроль</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ДатаГТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>DocumentRef.Контроль</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаГТД</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнвойса</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтрока020</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтрока028</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт1</name>
    <type>
      <types>DefinedType.Транспорт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контроль</name>
      <type>
        <types>DocumentRef.Контроль</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГТД</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИнвойса</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока020</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока028</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ГТД/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
 	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	ОбщийДокументы.НачальноеЗаполнение ( Объект );
	// Объект.Курс = получитьКурс ( Объект.ДатаГТД, Объект.Валюта );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьКурс ( Период, Валюта )
	
	курсы = ОбщийДокументы.ПолучитьКурс ( ? ( ЗначениеЗаполнено ( Период ), Период, ТекущаяДата () ), Валюта );
	Возврат курсы.Курс;

КонецФункции  

&НаКлиенте
Процедура ДатаГТДПриИзменении ( Элемент )
	
	Объект.Курс = получитьКурс ( Объект.ДатаГТД, Объект.Валюта );   
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении ( Элемент )
	
	рассчитатьСуммаГТД ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаПлатежа ()
	
	данные = Элементы.Транспорт.ТекущиеДанные;
	Если ( данные <> Неопределено ) Тогда
		данные.СуммаПлатежа = данные.СуммаСтрока020 + данные.СуммаСтрока028;   	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаГТД ()
	
	данные = Элементы.Транспорт.ТекущиеДанные;
	Если ( данные <> Неопределено ) Тогда
		данные.СуммаПлатежа = данные.СуммаСтрока020 + данные.СуммаСтрока028;   	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаСтрока020ПриИзменении ( Элемент )
	
	рассчитатьСуммаПлатежа ();
	рассчитатьСуммаГТД ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаСтрока028ПриИзменении ( Элемент )
	
	рассчитатьСуммаПлатежа ();
	рассчитатьСуммаГТД ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаИнвойсаПриИзменении ( Элемент )
	
	рассчитатьСуммаГТД ();
	
КонецПроцедуры
